#include "Header.h"
#include <algorithm>
#include <clocale>
#include <cmath>
#include <conio.h>
#include <cstdlib>
#include <ctime>
#include <fstream>
#include <iomanip>
#include <iostream>
#include <locale>
#include <math.h>
#include <random>
#include <set>
#include <sstream>
#include <string>
#include <typeinfo>
#include <utility>
#include <vector>
#include <windows.h>
#include <limits>


using namespace std;
/*
*Стряпунин Максим
*ИТ - 15
*вариант 14
*/

/*Задача 1 Sort2 :
Дано натуральное N и массив целых чисел размерности N. Отсортировать данный массив
по возрастанию методом простых обменов. В процессе сортировки отсортированную часть
накапливать в конце массива. Вывести содержимое массива после каждой итерации сортировки.
Одной итерацией сортировки считать такое действие, в результате которого один элемент мас-
сива гарантированно встает на правильное место в отсортированном массиве. При выводе мас-
сива отсортированную часть отделать от неотсортированной с помощью символа |. Протокол
сортировки выводить в текстовый файл.*/
/*
int main() {
    setlocale(0, "");
    int n;
    vector <int> arr;
    cout << "-------------------------------------------------------------------" << endl;
    cout << " : введите натуральное N" << endl 
         << " : (размерность массива)" << endl
         << " : --> ";
    cin >> n;
    if ((n <= 0) or (n >= 32767)) {
        do { cout << " : повторно введите N --> "; cin >> n; }
        while ((n <= 0) or (n >= 32767));
    }
    fillarr(arr, n);
    cout << endl << "-------------------------------------------------------------------" << endl;
    Simple_trades(arr, n);

    cout << endl;
    system("pause");
}
*/

 /*Задача 2 Sort14 :
  Дано целое число X и текстовый файл. В файле записан набор целых чисел, расположенных
  в неубывающем порядке. С помощью метода бинарного поиска определить индекс самого 
  левого вхождения числа X в исходный набор. Нумерация элементов начинается с нуля. Если
  элемент не найден, вывести -1. Чисел в исходном наборе не более 200.*/


int main() {

    cout << endl;
    system("pause");
}


/*Задача 3 ExamTaskC14:
 */

/*
  int main() {

     cout << endl;
     system("pause");
 }
*/
/*Задача 4 Five14:
 */

 /*
   int main() {

      cout << endl;
      system("pause");
  }
 */
